CSI API ETABS v1

# cPointObjGetLocalAxes Method

---

Retrieves the local axis angles for a point object.

**Namespace:** ETABSv1
**Assembly:** ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (1.27.0.0)

Syntax

C#

VB

C++

F#

Copy

    int GetLocalAxes(
    	string Name,
    	ref double A,
    	ref double B,
    	ref double C,
    	ref bool Advanced
    )

    Function GetLocalAxes (
    	Name As String,
    	ByRef A As Double,
    	ByRef B As Double,
    	ByRef C As Double,
    	ByRef Advanced As Boolean
    ) As Integer

    Dim instance As cPointObj
    Dim Name As String
    Dim A As Double
    Dim B As Double
    Dim C As Double
    Dim Advanced As Boolean
    Dim returnValue As Integer

    returnValue = instance.GetLocalAxes(Name,
    	A, B, C, Advanced)

    int GetLocalAxes(
    	String^ Name,
    	double% A,
    	double% B,
    	double% C,
    	bool% Advanced
    )

    abstract GetLocalAxes :
            Name : string *
            A : float byref *
            B : float byref *
            C : float byref *
            Advanced : bool byref -> int

#### Parameters

Name

    Type: SystemString
The name of an existing point object.

A

    Type: SystemDouble
The local axes of the point are defined by first setting the positive local 1,
2 and 3 axes the same as the positive global X, Y and Z axes and then doing
the following: [deg]

  1. Rotate about the 3 axis by angle a.
  2. Rotate about the resulting 2 axis by angle b.
  3. Rotate about the resulting 1 axis by angle c.

B

    Type: SystemDouble
The local axes of the point are defined by first setting the positive local 1,
2 and 3 axes the same as the positive global X, Y and Z axes and then doing
the following: [deg]

  1. Rotate about the 3 axis by angle a.
  2. Rotate about the resulting 2 axis by angle b.
  3. Rotate about the resulting 1 axis by angle c.

C

    Type: SystemDouble
The local axes of the point are defined by first setting the positive local 1,
2 and 3 axes the same as the positive global X, Y and Z axes and then doing
the following: [deg]

  1. Rotate about the 3 axis by angle a.
  2. Rotate about the resulting 2 axis by angle b.
  3. Rotate about the resulting 1 axis by angle c.

Advanced

    Type: SystemBoolean
This item is True if the point object local axes orientation was obtained
using advanced local axes parameters.

#### Return Value

Type: Int32
Returns zero if the local axes angles are successfully retrieved, otherwise it
returns a nonzero value.

Remarks

Examples

VB

Copy

    Public Sub Example()
       Dim SapModel As cSapModel
       Dim EtabsObject As cOAPI
       Dim ret As Integer = -1
       Dim GUID As String

    'create ETABS object
       Dim myHelper as cHelper = New Helper
       EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")

    'start ETABS application
      ret = EtabsObject.ApplicationStart()

    'create SapModel object
       SapModel = EtabsObject.SapModel

    'initialize model
       ret = SapModel.InitializeNewModel()

    'create steel deck template model
       ret = SapModel.File.NewSteelDeck(4, 12, 12, 4, 4, 24, 24)

    'get local axes assignments
       ret = SapModel.PointObj.GetLocalAxes("1", a, b, c, Advanced)

    'close ETABS
       EtabsObject.ApplicationExit(False)

    'clean up variables
       SapModel = Nothing
       EtabsObject = Nothing

    End Sub

See Also

#### Reference

cPointObj Interface

ETABSv1 Namespace

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com